Revit 2024 API
ParameterTypeId.AnalyticalModelEndAlignmentMethod Property
 "End Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModelEndAlignmentMethod { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelEndAlignmentMethod As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModelEndAlignmentMethod {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace